task-last/task-c/openfoam/task-17/init_file/broken_block/system/blockMeshDict
FoamFile
{
    format ascii;
    class dictionary;
    object blockMeshDict;
}
convertToMeters 0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (1 1 0.1) // ERROR_DUPLICATE_VERTEX: duplicates vertex 6
);

blocks
(
    hex (0 3 2 1 4 7 6 5) (20 20 1) simpleGrading (1 1 1) // ERROR_WRONG_HANDEDNESS
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (0 1 99 4) // ERROR_NONEXISTENT_FACE_VERTEX
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
